Repository: BoBoBaSs84/Magic.Switch.Board
Catalog: Magic.Switch.Board.Core/Properties/Resources.*.resx
Languages: es_es

# Enum_LogLevel_Critical_Description
source: Logs that describe an unrecoverable application or system crash, or a catastrophic failure that requires immediate attention.
es_es: Registros que describen un bloqueo irrecuperable de la aplicación o del sistema, o una falla catastrófica que requiere atención inmediata.

# Enum_LogLevel_Debug_Description
source: Logs that are used for interactive investigation during development. These logs should primarily contain information useful for debugging and have no long-term value.
es_es: Registros que se utilizan para la investigación interactiva durante el desarrollo. Estos registros deben contener principalmente información útil para la depuración y no tienen valor a largo plazo.

# Enum_LogLevel_Error_Description
source: Logs that highlight when the current flow of execution is stopped due to a failure. These should indicate a failure in the current activity, not an application-wide failure.
es_es: Registros que resaltan cuando el flujo actual de ejecución se detiene debido a un error. Estos deben indicar un error en la actividad actual, no un error en toda la aplicación.

# Enum_LogLevel_Information_Description
source: Logs that track the general flow of the application. These logs should have long-term value.
es_es: Registros que rastrean el flujo general de la aplicación. Estos registros deben tener un valor a largo plazo.

# Enum_LogLevel_None_Description
source: Not used for writing log messages. Specifies that a logging category should not write any messages.
es_es: No se utiliza para escribir mensajes de registro. Especifica que una categoría de registro no debe escribir ningún mensaje.

# Enum_LogLevel_Trace_Description
source: Logs that contain the most detailed messages. These messages may contain sensitive application data. These messages are disabled by default and should never be enabled in a production environment.
es_es: Registros que contienen los mensajes más detallados. Estos mensajes pueden contener datos confidenciales de la aplicación. Estos mensajes están deshabilitados de forma predeterminada y nunca deben habilitarse en un entorno de producción.

# Enum_LogLevel_Warning_Description
source: Logs that highlight an abnormal or unexpected event in the application flow, but do not otherwise cause the application execution to stop.
es_es: Registros que resaltan un evento anormal o inesperado en el flujo de la aplicación, pero que de otro modo no hacen que se detenga la ejecución de la aplicación.

# Enum_LoopChannels_1
source: Loop Channel 1
es_es: Canal de bucle 1

# Enum_LoopChannels_2
source: Loop Channel 2
es_es: Canal de bucle 2

# Enum_LoopChannels_3
source: Loop Channel 3
es_es: Canal de bucle 3

# Enum_LoopChannels_4
source: Loop Channel 4
es_es: Canal de bucle 4

# Enum_LoopChannels_5
source: Loop Channel 5
es_es: Canal de bucle 5

# Enum_LoopChannels_6
source: Loop Channel 6
es_es: Canal de bucle 6

# Enum_LoopChannels_7
source: Loop Channel 7
es_es: Canal de bucle 7

# Enum_LoopChannels_8
source: Loop Channel 8
es_es: Canal de bucle 8

# Enum_MidiChannel_1
source: Midi Channel 1
es_es: Midi Canal 1

# Enum_MidiChannel_10
source: Midi Channel 10
es_es: Midi Canal 10

# Enum_MidiChannel_11
source: Midi Channel 11
es_es: Midi Canal 11

# Enum_MidiChannel_12
source: Midi Channel 12
es_es: Midi Canal 12

# Enum_MidiChannel_13
source: Midi Channel 13
es_es: Midi Canal 13

# Enum_MidiChannel_14
source: Midi Channel 14
es_es: Midi Canal 14

# Enum_MidiChannel_15
source: Midi Channel 15
es_es: Midi Canal 15

# Enum_MidiChannel_16
source: Midi Channel 16
es_es: Midi Canal 16

# Enum_MidiChannel_2
source: Midi Channel 2
es_es: Midi Canal 2

# Enum_MidiChannel_3
source: Midi Channel 3
es_es: Midi Canal 3

# Enum_MidiChannel_4
source: Midi Channel 4
es_es: Midi Canal 4

# Enum_MidiChannel_5
source: Midi Channel 5
es_es: Midi Canal 5

# Enum_MidiChannel_6
source: Midi Channel 6
es_es: Midi Canal 6

# Enum_MidiChannel_7
source: Midi Channel 7
es_es: Midi Canal 7

# Enum_MidiChannel_8
source: Midi Channel 8
es_es: Midi Canal 8

# Enum_MidiChannel_9
source: Midi Channel 9
es_es: Midi Canal 9

# Enum_MidiMessageType_CCM
source: Control Change Message
es_es: Mensaje de cambio de control

# Enum_MidiMessageType_PCM
source: Program Change Message
es_es: Mensaje de cambio de programa

# Enum_SwitchChannels_1
source: Switch Channel 1
es_es: Cambiar de canal 1

# Enum_SwitchChannels_2
source: Switch Channel 2
es_es: Conmutador de canal 2

# Enum_SwitchChannels_3
source: Switch Channel 3
es_es: Conmutador de canal 3

# Enum_SwitchChannels_4
source: Switch Channel 4
es_es: Conmutador de canal 4

# Enum_SwitchChannels_5
source: Switch Channel 5
es_es: Conmutador de canal 5

# Enum_SwitchChannels_6
source: Switch Channel 6
es_es: Cambiar canal 6

# Enum_SwitchChannels_7
source: Switch Channel 7
es_es: Conmutador de canal 7

# Enum_SwitchChannels_8
source: Switch Channel 8
es_es: Cambiar canal 8

# Error_Xml_Unknown_Attribute
source: Error during deserialisation. Unkown attribute found. Name: '{0}' at line: {1} and position: {2}.
es_es: Error durante la deserialización. Atributo desconocido encontrado. Nombre: '{0}' en línea: {1} y posición: {2}.

# Error_Xml_Unknown_Element
source: Error during deserialisation. Unkown element found. Name: '{0}' at line: {1} and position: {2}.
es_es: Error durante la deserialización. Elemento desconocido encontrado. Nombre: '{0}' en línea: {1} y posición: {2}.

# Error_Xml_Unknown_Node
source: Error during deserialisation. Unkown node found. Name: '{0}' of type: '{1}'
es_es: Error durante la deserialización. Nodo desconocido encontrado. Nombre: '{0}' de tipo: '{1}'

# File_Service_Error_Directory
source: The directory could not be found.
es_es: No se pudo encontrar el directorio.

# File_Service_Error_File
source: The file could not be found.
es_es: No se pudo encontrar el archivo.

# File_Service_File_Created
source: The file '{0}' was created.
es_es: Se ha creado el archivo '{0}'.

# File_Service_File_Deleted
source: The file '{0}' has been deleted.
es_es: El archivo '{0}' ha sido eliminado.

# File_Service_File_Read
source: The file '{0}' has been loaded.
es_es: El archivo '{0}' ha sido cargado.

# Model_Field_Range_Generic
source: {0} must be in a range between {2} and {1}.
es_es: {0} debe estar en un rango entre {2} y {1}.

# Model_Field_Required_Generic
source: {0} is a required field.
es_es: {0} es un campo obligatorio.

# Model_Field_StringLength_Generic
source: {0} must be between {2} and {1} characters long.
es_es: {0} debe tener entre {2} y {1} caracteres.
